In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\dell\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\appdata\roaming\python\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\dell\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [1]:
import pandas as pd

### Dtasets !

In [3]:
data = {
    'Student' : ["Amit", "John", "Jacob", "David", "Steve"],
    'rank' : [1, 4, 3, 5, 2],
    'marks' : [95, 70, 80, 60, 90]
}

res = pd.DataFrame(data)

print("Student Records\n\n",res)

Student Records

   Student  rank  marks
0    Amit     1     95
1    John     4     70
2   Jacob     3     80
3   David     5     60
4   Steve     2     90

# Series

In [5]:
A = pd.Series([2,3,4,5], index = ['a', 'b', 'c', 'd'])

In [6]:
A.values

array([2, 3, 4, 5], dtype=int64)

In [7]:
A.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [8]:
A['a']

2

In [10]:
A['a':'c']

a    2
b    3
c    4
dtype: int64

In [11]:
grades_dict = {'A':4, 'B':3.5, 'C':3, 'D':2.5}
grades = pd.Series(grades_dict)

In [12]:
grades.values

array([4. , 3.5, 3. , 2.5])

In [14]:
marks_dict = {'A':85, 'B':75, 'C':65, 'D':55}
marks = pd.Series(marks_dict)

In [15]:
marks

A    85
B    75
C    65
D    55
dtype: int64

In [16]:
marks[0:2]

A    85
B    75
dtype: int64

# DataFrame

In [20]:
D = pd.DataFrame({'grades':grades, 'marks':marks})

In [21]:
D

   grades  marks
A     4.0     85
B     3.5     75
C     3.0     65
D     2.5     55

In [22]:
D.T

           A     B     C     D
grades   4.0   3.5   3.0   2.5
marks   85.0  75.0  65.0  55.0

In [23]:
D.values

array([[ 4. , 85. ],
       [ 3.5, 75. ],
       [ 3. , 65. ],
       [ 2.5, 55. ]])

In [24]:
D.values[2,1]

65.0

In [25]:
D

   grades  marks
A     4.0     85
B     3.5     75
C     3.0     65
D     2.5     55

In [26]:
del D['grades']

In [27]:
D

   marks
A     85
B     75
C     65
D     55

In [30]:
G = D[D['marks']>60]

In [31]:
G

   marks
A     85
B     75
C     65

In [32]:
A = pd.DataFrame([{'a':1, 'b':4},{'b':-3, 'c':9}])
A

     a  b    c
0  1.0  4  NaN
1  NaN -3  9.0

In [33]:
A.fillna(0)

     a  b    c
0  1.0  4  0.0
1  0.0 -3  9.0

In [34]:
A.dropna?

### Explicit Index

In [35]:
A = pd.Series(['a', 'b', 'c'],index = [1, 3, 5])

In [36]:
A[1]

'a'

In [38]:
A[1:3]

3    b
5    c
dtype: object

In [39]:
A.loc[1:3]

1    a
3    b
dtype: object

### Implicit Index

In [40]:
A.iloc[1:3]

3    b
5    c
dtype: object

In [41]:
D

   marks
A     85
B     75
C     65
D     55

In [42]:
D['grades'] = grades

In [43]:
D

   marks  grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [44]:
D.iloc[2,:]

marks     65.0
grades     3.0
Name: C, dtype: float64

In [45]:
D.iloc[::-1,:]

   marks  grades
D     55     2.5
C     65     3.0
B     75     3.5
A     85     4.0